# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).

#num = input ("Введите произвольное целое число: ")
#i = 0
#while i < len(num):
#        print(num[i])
#        i = i + 1

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.

#num1 = input("Введите первую переменную: ")
#num2 = input("Введите вторую переменную: ")
#temp = num1
#num1 = num2
#num2 = temp
#print("Теперь первая переменная = ", num1, ", а вторая переменная = ", num2)

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
#age = int (input ("Введите свой возраст: "))
#if age>=18:
# print ("Доступ разрешен")
#else:
# print ("Извините, пользование данным ресурсом только с 18 лет")

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
#num = int (input ("Введите произвольное целое число: "))
#num = str(num)
#i = 0
#max = 0
#while i < len(num):
#        print(num[i])
#        if max < int(num[i]):
#            max = int(num[i])
#        i = i + 1
#print("Максимальная цифра в введенном числе: ", max)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.

#num1 = input("Введите первую переменную: ")
#num2 = input("Введите вторую переменную: ")
#num1, num2 = num2, num1
#print("Теперь первая переменная = ", num1, ", а вторая переменная = ", num2)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax? + bx + c = 0.
#import math
#a = float (input ("Введите коэффициент a = "))
#b = float (input ("Введите коэффициент b = "))
#c = float (input ("Введите коэффициент c = "))
#if a==0:
#      print ("x=", -c/b)
#else:
#      D=b**2-4*a*c
#      if D<0:
#         print ("Дискриминант отрицательный, решения нет")
#      else:
#         if D==0:
#           print ("x=", -b/(2*a))
#         else: print ("x1=", ((-b+math.sqrt(D))/(2*a)), "x2=", ((-b-math.sqrt(D))/(2*a)))